## Final Project Submission

Please fill out: 
* Student name: Gerald Mwangi
* Student pace:  full time
* Scheduled project review date/time: 
* Instructor name: Asha Deen
* Blog post URL: N/A

             MICROSOFT MOVIE STUDIO EXPLORATORY DATA ANALYSIS

    INRODUCTION

    As Microsoft ventures into the realm of movie production, understanding the dynamics of the box office is crucial for making informed decisions. Through thorough exploratory data analysis (EDA) of various movie datasets, we aim to provide actionable insights to guide Microsoft's new movie studio in selecting the most promising film genres and strategies for success

    BUSINESS PROBLEM

    Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

    BUSINESS UNDERSTANDING

    Analysing several movie datasets from sources like Box Office Mojo, IMDB, Rotten Tomatoes, TheMovieDB, and The Numbers and analysing this data to find trends and patterns that will help Microsoft make wise choices about the kinds of films it should make.

    INSIGHTS TO BE GENERATED
    1. GENRE ANALYSIS
    2. DIRECTOR ANALYSIS
    3. RETURN ON INVESTMENT

DATA UNDERSTANDING

1.1 IMPORTING LIBRARIES

In [30]:
# importing libraries
import pandas as pd 
import numpy as np 
import sqlite3 
import seaborn as sns 
import matplotlib.pyplot as plt 
%matplotlib inline
from zipfile import ZipFile

1.2 LOADING DATA SETS

In [31]:
import zipfile

with zipfile.ZipFile(r"C:\Users\user\Downloads\dsc-phase-1-project-v2-4-master\dsc-phase-1-project-v2-4-master\zippedData\im.db.zip", 'r') as zObject:
    zObject.extractall(path=r"C:\Users\user\Downloads\dsc-phase-1-project-v2-4-master\dsc-phase-1-project-v2-4-master\zippedData")

In [32]:
# Function is created to load the data
def load_data(path, data_format):
    
    # if statement used to differentiate data format. Checks if data is in 'csv' format
    if data_format.lower() == 'csv':
        data = pd.read_csv(path, compression='gzip') # 'compression' parameter used since the file is compressed
    # elif statement used to check if data is in 'db' format
    elif data_format.lower() == 'db':
        conn = sqlite3.connect(path) # returns a Connection object that we will use to interact with the database
        return conn
    # else statement returns an error if the data format is not recognized
    else:
        raise ValueError('Data format not recognized')
    
    return data

In [33]:
# the number dataset showing movie budgets
movie_budgets_df = load_data(r"C:\Users\user\Downloads\dsc-phase-1-project-v2-4-master\dsc-phase-1-project-v2-4-master\zippedData\tn.movie_budgets.csv.gz", "csv")
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [34]:
movie_budgets_df.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [35]:
movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [40]:
#connect to the imbd dataset

conn = load_data(r"C:\Users\user\Documents\project\dsc-phase-1-project-v2-4\zippedData\im.db\im.db" , "db")
imdb_tables = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
imdb_tables

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [44]:
movie_basics_df = pd.read_sql("""
                      SELECT * 
                        FROM  movie_basics AS mb """, conn)

movie_basics_df.head(10)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

In [45]:
movie_basics_df.tail()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [46]:
movie_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [47]:
movie_akas_df = pd.read_sql("""
                      SELECT * 
                        FROM  movie_akas
                      ;
                      """, conn)

movie_akas_df.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0

In [48]:
movie_akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [49]:
movie_ratings_df = pd.read_sql("""
                      SELECT * 
                        FROM  movie_ratings
                      ;
                      """, conn)

movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [50]:
q = pd.read_sql(
    """
SELECT b.start_year, COUNT(*) AS n_movies 
FROM movie_basics as b
JOIN movie_ratings as r
USING (movie_id)
WHERE b.start_year BETWEEN 2015 AND 2020
GROUP BY b.start_year
""",
    conn,
)
q.head(10)

   start_year  n_movies
0        2015      8494
1        2016      8721
2        2017      8713
3        2018      7526
4        2019      2180

In [51]:
q1 = pd.read_sql(
    """
SELECT b.genres, SUM(numvotes) AS votes, AVG(r.averagerating) AS avg_rating
FROM movie_ratings as r
LEFT JOIN movie_basics as b
USING (movie_id)
WHERE start_year BETWEEN 2015 AND 2020
GROUP BY b.genres
ORDER BY votes DESC, avg_rating DESC;
""",
    conn)
q1

                         genres    votes  avg_rating
0       Action,Adventure,Sci-Fi  8508126    5.428571
1      Action,Adventure,Fantasy  5972775    5.790566
2       Action,Adventure,Comedy  4573290    5.533333
3    Adventure,Animation,Comedy  3468681    5.939130
4                         Drama  2810070    6.597468
..                          ...      ...         ...
766               History,Sport        5    9.200000
767   Action,Documentary,Horror        5    6.400000
768  Documentary,Family,Romance        5    6.200000
769                  Family,War        5    5.800000
770      Animation,Family,Music        5    4.600000

[771 rows x 3 columns]

In [59]:
#Select movies and director info from imdb database
q2 = pd.read_sql(
    """
SELECT r.movie_id, a.title, r.averagerating AS rating, r.numvotes, b.genres, p.primary_name AS director, b.runtime_minutes
FROM movie_ratings as r
LEFT JOIN movie_basics as b
USING (movie_id)
LEFT JOIN movie_akas as a
USING (movie_id)
LEFT JOIN directors as d
USING (movie_id)
LEFT JOIN persons as p
USING(person_id)
WHERE is_original_title = 1.0
ORDER BY r.averagerating DESC;
""",
    conn
)
q2 = q2.drop_duplicates(subset=["movie_id"])# dropping duplicates
q2.dropna() #dropping null values

,movie_id,title,rating,numvotes,genres,director,runtime_minutes
0,tt10176328,Exteriores: Mulheres Brasileiras na Diplomacia,10.0,5,Documentary,Ivana Diniz,52.0
2,tt5390098,Atlas Mountain: Barbary Macaques - Childcaring...,10.0,5,Documentary,Masahiro Hayakawa,59.0
4,tt5012400,"Pieces of Lives, Pieces of Dreams",9.8,6,Documentary,Hamid Benamra,100.0
5,tt8986906,RISE: The Story of Augustines,9.8,45,"Documentary,Music",Todd Howe,80.0
6,tt6271662,Hizam,9.8,6,Documentary,Hamid Benamra,86.0
...,...,...,...,...,...,...,...
93034,tt4937514,A no dentou,1.0,388,Drama,Keiko Tsuruoka,53.0
93035,tt4986830,Pure Hearts: Into Chinese Showbiz,1.0,453,"Comedy,Drama",Zhifei Bi,96.0
93039,tt6017238,Priklyucheniya Volodi Zlogo,1.0,21,"Adventure,Comedy",Maxim Gromov,76.0
93043,tt4932436,Onna no ko yo shitai to odore,1.0,385,Comedy,Kayoko Asakura,70.0
93044,tt5880884,Bloody Massacre,1.0,22,"Drama,Horror,Thriller",Eldar Bogunov,82.0

In [ ]:
#preparing to merge the movies budgets  df with q2 to form movie_df
movie_budgets_df = movie_budgets_df.rename(columns={"movie": "title"})